RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_flash.h
/** Flash Program row data location configuration */
typedef enum
{
    CY_FLASH_PROGRAMROW_DATA_LOCATION_SRAM       = (0x01UL)  /**< Program Row data location is sram */
} cy_en_flash_programrow_location_t;

/** Flash Program row interrupt mask configuration */
typedef enum
{
    CY_FLASH_PROGRAMROW_NOT_SET_INTR_MASK = (0x00UL),  /**< Program Row API interrupt is not set */
    CY_FLASH_PROGRAMROW_SET_INTR_MASK     = (0x01UL)   /**< Program Row API interrupt is set */
} cy_en_flash_programrow_intrmask_t;

/** Flash Erase sector function execution type configuration */
typedef enum
{
    CY_FLASH_ERASESECTOR_NON_BLOCKING      = (0x00UL), /**< Erase sector API execited in non blocking mode */
    CY_FLASH_ERASESECTOR_BLOCKING          = (0x01UL)  /**< Erase sector API execited in blocking mode */
} cy_en_flash_erasesector_blocking_t;

/** Flash Erase sector interrupt mask configuration */
typedef enum
{
    CY_FLASH_ERASESECTOR_NOT_SET_INTR_MASK = (0x00UL), /**< Erase sector API interrupt is not set */
    CY_FLASH_ERASESECTOR_SET_INTR_MASK     = (0x01UL)  /**< Erase sector API interrupt is set */
} cy_en_flash_erasesector_intrmask_t;

/** Flash cheksum bank configuration */
typedef enum
{
    CY_FLASH_CHECKSUM_BANK0     = (0x00UL), /**< Checksum calculated for Bank0 */
    CY_FLASH_CHECKSUM_BANK1     = (0x01UL)  /**< Checksum calculated for Bank1 */
} cy_en_flash_checksum_bank_t;

/** Flash cheksum page configuration */
typedef enum
{
    CY_FLASH_CHECKSUM_PAGE     = (0x00UL), /**< Checksum calculated for that page */
    CY_FLASH_CHECKSUM_WHOLE    = (0x01UL)  /**< Checksum calculated for whole region */
} cy_en_flash_checksum_scope_t;

/** Flash cheksum region configuration */
typedef enum
{
    CY_FLASH_CHECKSUM_MAIN        = (0x00UL), /**< Checksum calculated for Main flash region */
    CY_FLASH_CHECKSUM_WORK        = (0x01UL), /**< Checksum calculated for Work flash region */
    CY_FLASH_CHECKSUM_SUPERVISORY = (0x02UL)  /**< Checksum calculated for Supervisory flash region */
} cy_en_flash_checksum_region_t;

/** Flash compute hash configuration */
typedef enum
{
    CY_FLASH_COMPUTEHASH_BASIC  = (0x00UL), /**< Compute Basic hash */
    CY_FLASH_COMPUTEHASH_CRC8   = (0x01UL)  /**< Compute CRC8 hash */
} cy_en_flash_computehash_type_t;

/** Flash Erase resume interrupt mask configuration */
typedef enum
{
    CY_FLASH_ERASERESUME_NOT_SET_INTR_MASK  = (0x00UL), /**< Erase resume API interrupt is not set */
    CY_FLASH_ERASERESUME_SET_INTR_MASK      = (0x01UL)  /**< Erase resume API interrupt is set */
} cy_en_flash_eraseresume_setintr_t;

/** Flash Erase resume function execution type configuration */
typedef enum
{
    CY_FLASH_ERASERESUME_NON_BLOCKING  = (0x00UL), /**< Set erase resume API in non blocking mode */
    CY_FLASH_ERASERESUME_BLOCKING      = (0x01UL)  /**< Set erase resume API in blocking mode */
} cy_en_flash_eraseresume_blocking_t;

/** Flash driver function execution type configuration */
typedef enum
{
    CY_FLASH_DRIVER_NON_BLOCKING  = (0x00UL),    /**< Set SROM API in non blocking mode */
    CY_FLASH_DRIVER_BLOCKING      = (0x01UL)     /**< Set SROM API in blocking mode */
} cy_en_flash_driver_blocking_t;

/** \} group_flash_enumerated_types */
#endif // (defined(CY_IP_MXFLASHC_VERSION_ECT))

/***************************************
* Data Structure definitions
***************************************/
#if (defined(CY_IP_MXFLASHC_VERSION_ECT))

/**
* \addtogroup group_flash_srom_config_structure
* \{
*/
/** Flash program row configuration structure */
typedef struct
{
    const uint32_t*                         destAddr; /**< Specifies the configuration of flash operation */
    const uint32_t*                         dataAddr; /**< Specifies the configuration of flash operation */
    cy_en_flash_programrow_blocking_t       blocking; /**< Specifies the code of flash operation */
    cy_en_flash_programrow_skipblankcheck_t skipBC;   /**< Specifies the code of flash operation */
    cy_en_flash_programrow_datasize_t       dataSize; /**< Specifies the configuration of flash operation */
    cy_en_flash_programrow_location_t       dataLoc;  /**< Specifies the configuration of flash operation */
    cy_en_flash_programrow_intrmask_t       intrMask; /**< Specifies the configuration of flash operation */
}cy_stc_flash_programrow_config_t;

/** Flash erase row configuration structure */
typedef struct
{
    const uint32_t*                    sectorAddr;     /**< Specifies the configuration of flash operation */
    cy_en_flash_erasesector_blocking_t blocking; /**< Specifies the code of flash operation */
    cy_en_flash_erasesector_intrmask_t intrMask; /**< Specifies the configuration of flash operation */
}cy_stc_flash_erasesector_config_t;

/** Flash checksum configuration structure */
typedef struct
{
    uint8_t                       rowId;  /**< Specifies the configuration of flash operation */
    cy_en_flash_checksum_bank_t   bank;   /**< Specifies the code of flash operation */
    cy_en_flash_checksum_scope_t  whole;  /**< Specifies the configuration of flash operation */
    cy_en_flash_checksum_region_t region; /**< Specifies the configuration of flash operation */
} cy_stc_flash_checksum_config_t;

/** Flash compute hash configuration structure */
typedef struct
{
    const uint32_t*                startAddr; /**< Specifies the configuration of flash operation */
    uint32_t                       numOfByte; /**< Specifies the configuration of flash operation */
    cy_en_flash_computehash_type_t type;      /**< Specifies the code of flash operation */
} cy_stc_flash_computehash_config_t;

/** Flash erase resume configuration structure */
typedef struct
{
    cy_en_flash_eraseresume_setintr_t  intrMask; /**< Specifies the code of flash operation */
    cy_en_flash_eraseresume_blocking_t blocking; /**< Specifies the code of flash operation */
} cy_stc_flash_eraseresume_config_t;

/** Flash blank check configuration structure */
typedef struct
{
    const uint32_t* addrToBeChecked;         /**< Specifies the configuration of flash operation */
    uint32_t        numOfWordsToBeChecked;   /**< Specifies the configuration of flash operation */
} cy_stc_flash_blankcheck_config_t;

/** \} group_flash_srom_config_structure */

#endif // (defined(CY_IP_MXFLASHC_VERSION_ECT))


