RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_flash.h
/***************************************
* Function Prototypes
***************************************/
#if (defined(CY_IP_MXFLASHC_VERSION_ECT))


/**
* \addtogroup group_flash_functions
* \{
*/


/*******************************************************************************
* Function Name: Cy_Flashc_MainWriteEnable
****************************************************************************//**
*
* \brief Enable writing to main flash.
* Enables writing to main flash.
*
* \note This function is applicable for CAT1C devices.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_MainWriteEnable(void);


/*******************************************************************************
* Function Name: Cy_Flashc_MainWriteDisable
****************************************************************************//**
*
* \brief Disable writing to main flash
* Disables writing to main flash.
*
* \note This function is applicable for CAT1C devices.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_MainWriteDisable(void);


/*******************************************************************************
* Function Name: Cy_Flashc_WorkWriteEnable
****************************************************************************//**
*
* \brief Enable writing work flash
* Work Flash embedded operations are enabled.
*
* \note This function is applicable for CAT1C devices.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_WorkWriteEnable(void);


/*******************************************************************************
* Function Name: Cy_Flashc_WorkWriteDisable
****************************************************************************//**
*
* \brief Disable writing work flash
* Work Flash embedded operations are blocked
*
* \note This function is applicable for CAT1C devices.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_WorkWriteDisable(void);


/*******************************************************************************
* Function Name: Cy_Flashc_WorkECCEnable
****************************************************************************//**
*
* \brief Enables ECC for work flash
* ECC checking/reporting on FLASH work interface is enabled.
* Correctable or non-correctable faults are reported by enabling ECC.
*
* \note This function is applicable for CAT1C devices.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_WorkECCEnable(void);

/*******************************************************************************
* Function Name: Cy_Flashc_WorkECCDisable
****************************************************************************//**
*
* \brief Disables ECC for work flash
* ECC checking/reporting on FLASH work interface is disabled.
* No correctable or non-correctable faults are reported by disabling ECC.
*
* \note This function is applicable for CAT1C devices.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_WorkECCDisable(void);


/*******************************************************************************
* Function Name: Cy_Flashc_MainECCEnable
****************************************************************************//**
*
* \brief Enables ECC for main flash
* ECC checking/reporting on FLASH main interface is enabled.
* Correctable or non-correctable faults are reported by enabling ECC.
*
* \note This function is applicable for CAT1C devices.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_MainECCEnable(void);

/*******************************************************************************
* Function Name: Cy_Flashc_MainECCDisable
****************************************************************************//**
*
* \brief Disables ECC for main flash.
* ECC checking/reporting on FLASH main interface is disabled.
* No correctable or non-correctable faults are reported by disabling ECC.
*
* \note This function is applicable for CAT1C devices.
*
* \return none
*
*******************************************************************************/
void Cy_Flashc_MainECCDisable(void);

/*******************************************************************************
* Function Name: Cy_Flash_Program_WorkFlash
****************************************************************************//**
*
* This function writes an array data to work flash. Reports success or
* or a reason for failure. User should only pass work flash address else it will return an error.
* This function executes in blocking mode only.
*
* Returns immediately and reports a CY_FLASH_DRV_IPC_BUSY error in the case when another
* process is operating flash. User firmware should not enter the hibernate
* mode until flash Write is complete. The Flash operation is allowed in Sleep and
* Deep-sleep modes. During the Flash operation, the device should not be reset,
* including the XRES pin, a software reset, and watchdog reset sources. Also,
* low-voltage detect circuits should be configured to generate an interrupt instead
* of a reset. Otherwise, portions of flash may undergo unexpected changes.
* \note  A Read while Write violation occurs when a flash Read operation is initiated
* in the same or neighboring flash sector where the flash Write, Erase, or
* Program operation is working. This violation may cause a HardFault exception.
* To avoid the Read while Write violation,
* use Cy_Flash_IsOperationComplete() to ensure flash operation is complete.
*
* \note This function is applicable for CAT1C devices.
*
* \param config configuration of this function.
* This parameter is defined by the cy_stc_flash_programrow_config_t
* in \ref group_flash_srom_config_structure macro.
*
* \return Returns the status of the Flash operation (see \ref cy_en_flashdrv_status_t).
*
* \funcusage
* \snippet flash/snippet/main.c snippet_Cy_Flash_Program_WorkFlash
*
*******************************************************************************/
cy_en_flashdrv_status_t Cy_Flash_Program_WorkFlash(const cy_stc_flash_programrow_config_t* config);

